jimmywong2003/nrf52-ble-range-estimator/components_modified/ble_services/ble_image_transfer_service/ble_image_transfer_service.c
        ble_uuid.type = p_its->uuid_type;
        ble_uuid.uuid = BLE_UUID_ITS_RX_DATA_CHARACTERISTIC;

        memset(&attr_md, 0, sizeof(attr_md));

        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);

        attr_md.vloc = BLE_GATTS_VLOC_STACK;
        attr_md.rd_auth = 0;
        attr_md.wr_auth = 0;
        attr_md.vlen = 1;

        memset(&attr_char_value, 0, sizeof(attr_char_value));

        attr_char_value.p_uuid = &ble_uuid;
        attr_char_value.p_attr_md = &attr_md;
        attr_char_value.init_len = 1;
        attr_char_value.init_offs = 0;
        attr_char_value.max_len = BLE_ITS_MAX_RX_CHAR_LEN;

        return sd_ble_gatts_characteristic_add(p_its->service_handle,
                                               &char_md,
                                               &attr_char_value,
                                               &p_its->rx_data_handles);
}

static uint32_t push_data_packets()
{
        uint32_t return_code = NRF_SUCCESS;
        uint32_t packet_length = m_max_data_length;
        uint32_t packet_size = 0;

        NRF_LOG_INFO("file_size %x, file_pos %x", file_size, file_pos);

        while (return_code == NRF_SUCCESS)
        {
                if (file_pos > file_size)
                {
                        break;
                }
                if ((file_size - file_pos) > packet_length)
                {
                        packet_size = packet_length;
                }
                else if ((file_size - file_pos) > 0)
                {
                        packet_size = file_size - file_pos;
                }

                if (packet_size > 0)
                {
                        return_code = ble_its_string_send(m_its, &file_data[file_pos], packet_size);
                        if (return_code == NRF_SUCCESS)
                        {
                                file_pos += packet_size;
                                m_image_send_byte += packet_size;
                        }
                }
                else
                {
                        file_size = 0;
                        break;
                }
        }
        return return_code;
}

static volatile bool nrf_error_resources = false;

void ble_its_on_ble_evt(ble_evt_t const *p_ble_evt, void *p_context)
{
        if ((p_context == NULL) || (p_ble_evt == NULL))
        {
                return;
        }

        ble_its_t *p_its = (ble_its_t *)p_context;

        switch (p_ble_evt->header.evt_id)
        {
        case BLE_GAP_EVT_CONNECTED:
                on_connect(p_its, p_ble_evt);
                break;

        case BLE_GAP_EVT_DISCONNECTED:
                on_disconnect(p_its, p_ble_evt);
                break;

        case BLE_GATTS_EVT_WRITE:
                on_write(p_its, p_ble_evt);
                break;

        case BLE_GATTS_EVT_HVC:
                NRF_LOG_INFO("BLE_GATTS_EVT_HVC");
                break;

        case BLE_GATTS_EVT_HVN_TX_COMPLETE:
        {
                //uint32_t count = p_ble_evt->evt.gatts_evt.params.hvn_tx_complete.count;
                if (file_size > 0)
                {
                        push_data_packets();
                }
                else
                {
                        ble_its_evt_t its_evt;
                        its_evt.evt_type = BLE_ITS_EVT_ITS_TX_DATA_COMPLETE_EVT;
                        p_its->evt_handler(p_its, &its_evt);
                }
                nrf_error_resources = false;
        }
        break;

        default:
                // No implementation needed.
                break;
        }
}

uint32_t ble_its_init(ble_its_t *p_its, const ble_its_init_t *p_its_init)
{
        uint32_t err_code;
        ble_uuid_t ble_uuid;
        ble_uuid128_t its_base_uuid = ITS_BASE_UUID;

        VERIFY_PARAM_NOT_NULL(p_its);
        VERIFY_PARAM_NOT_NULL(p_its_init);

        // Initialize the service structure.
        p_its->conn_handle = BLE_CONN_HANDLE_INVALID;
        p_its->evt_handler = p_its_init->evt_handler;
        p_its->is_notification_enabled = false;

        /**@snippet [Adding proprietary Service to S110 SoftDevice] */
        // Add a custom base UUID.
        err_code = sd_ble_uuid_vs_add(&its_base_uuid, &p_its->uuid_type);
        VERIFY_SUCCESS(err_code);

        ble_uuid.type = p_its->uuid_type;
        ble_uuid.uuid = BLE_UUID_ITS_SERVICE;

        // Add the service.
        err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY,
                                            &ble_uuid,
                                            &p_its->service_handle);
        /**@snippet [Adding proprietary Service to S110 SoftDevice] */
        VERIFY_SUCCESS(err_code);

        // Add the RX Characteristic.
        err_code = rx_char_add(p_its, p_its_init);
        VERIFY_SUCCESS(err_code);

        err_code = rx_data_char_add(p_its, p_its_init);
        VERIFY_SUCCESS(err_code);

        // Add the TX Characteristic.
        err_code = tx_char_add(p_its, p_its_init);
        VERIFY_SUCCESS(err_code);

        // Add the Image Info Characteristic.
        err_code = img_info_char_add(p_its, p_its_init);
        VERIFY_SUCCESS(err_code);

        return NRF_SUCCESS;
}

uint32_t ble_its_string_send(ble_its_t *p_its, uint8_t *p_string, uint16_t length)
{
        ble_gatts_hvx_params_t hvx_params;
        uint32_t err_code;

        if (nrf_error_resources)
        {
                return NRF_ERROR_RESOURCES;
        }

        VERIFY_PARAM_NOT_NULL(p_its);

        if ((p_its->conn_handle == BLE_CONN_HANDLE_INVALID) || (!p_its->is_notification_enabled))
        {
                return NRF_ERROR_INVALID_STATE;
        }

        if (length > BLE_ITS_MAX_DATA_LEN)
        {
                return NRF_ERROR_INVALID_PARAM;
        }

        memset(&hvx_params, 0, sizeof(hvx_params));
        hvx_params.handle = p_its->tx_handles.value_handle;
        hvx_params.p_data = p_string;
        hvx_params.p_len = &length;
        hvx_params.type = BLE_GATT_HVX_NOTIFICATION;

