jimmywong2003/nrf52-ble-range-estimator/components_modified/ble_services/ble_image_transfer_service/ble_image_transfer_service.c
        err_code = sd_ble_gatts_hvx(p_its->conn_handle, &hvx_params);

        if (err_code == NRF_ERROR_RESOURCES)
        {
                nrf_error_resources = true;
        }

        return err_code;
}

// uint32_t ble_its_img_info_send(ble_its_t *p_its, ble_its_img_info_t *img_info)
// {
//         uint8_t data_buf[sizeof(ble_its_img_info_t)];
//         ble_gatts_hvx_params_t hvx_params;
//
//         VERIFY_PARAM_NOT_NULL(p_its);
//
//         if ((p_its->conn_handle == BLE_CONN_HANDLE_INVALID) || (!p_its->is_info_char_notification_enabled))
//         {
//                 return NRF_ERROR_INVALID_STATE;
//         }
//
//         uint16_t length = sizeof(ble_its_img_info_t);
//
//         memcpy(&data_buf[0], img_info, sizeof(ble_its_img_info_t));
//
//         // memcpy(&m_image_info, img_info, sizeof(ble_its_img_info_t));
//
//         memset(&hvx_params, 0, sizeof(hvx_params));
//
//         hvx_params.handle = p_its->img_info_handles.value_handle;
//         hvx_params.p_data = data_buf;
//         hvx_params.p_len = &length;
//         hvx_params.type = BLE_GATT_HVX_NOTIFICATION;
//
//         return sd_ble_gatts_hvx(p_its->conn_handle, &hvx_params);
// }

uint32_t ble_its_cmd_data_send(ble_its_t *p_its, ble_its_cmd_data_t *cmd_data)
{
        uint8_t data_buf[sizeof(ble_its_cmd_data_t)];
        uint16_t length = sizeof(ble_its_cmd_data_t);
        ble_gatts_hvx_params_t hvx_params;

        VERIFY_PARAM_NOT_NULL(p_its);

        if ((p_its->conn_handle == BLE_CONN_HANDLE_INVALID) || (!p_its->is_info_char_notification_enabled))
        {
                return NRF_ERROR_INVALID_STATE;
        }

        memcpy(&data_buf[0], cmd_data, sizeof(ble_its_cmd_data_t));

        memset(&hvx_params, 0, sizeof(hvx_params));

        hvx_params.handle = p_its->img_info_handles.value_handle;
        hvx_params.p_data = data_buf;
        hvx_params.p_len = &length;
        hvx_params.type = BLE_GATT_HVX_NOTIFICATION;

        return sd_ble_gatts_hvx(p_its->conn_handle, &hvx_params);
}

uint32_t ble_its_send_file(ble_its_t *p_its, uint8_t *p_data, uint32_t data_length, uint32_t max_packet_length)
{
        uint32_t err_code;

        if ((p_its->conn_handle == BLE_CONN_HANDLE_INVALID) || (!p_its->is_notification_enabled))
        {
                return NRF_ERROR_INVALID_STATE;
        }

        if (file_size != 0)
        {
                return NRF_ERROR_BUSY;
        }

        // ble_its_img_info_t m_image_info;
        // m_image_info.file_size_bytes = data_length;
        // ble_its_img_info_send(p_its, &m_image_info);

        m_image_send_byte = 0;

        file_size = data_length;
        file_pos = 0;
        file_data = p_data;
        m_max_data_length = max_packet_length;
        m_its = p_its;

        err_code = push_data_packets();
        if (err_code == NRF_ERROR_RESOURCES)
                return NRF_SUCCESS;
        return err_code;
}

uint32_t ble_its_send_file_fragment(ble_its_t *p_its, uint8_t *p_data, uint32_t data_length)
{
        uint32_t err_code;

        if ((p_its->conn_handle == BLE_CONN_HANDLE_INVALID) || (!p_its->is_notification_enabled))
        {
                return NRF_ERROR_INVALID_STATE;
        }

        if (file_size != 0)
        {
                return NRF_ERROR_BUSY;
        }

        err_code = ble_its_string_send(p_its, p_data, data_length);
        return err_code;
}

bool ble_its_file_transfer_busy(void)
{
        return file_size != 0;
}

#endif // NRF_MODULE_ENABLED(BLE_NUS)
